benchmark/leveldb/results/micro/mris_ran_wt_sata.3.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:41:35 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :   10444.981 micros/op;    6.4 MB/s
Microseconds per op:
Count: 20000  Average: 10444.5725  StdDev: 253214.09
Min: 120.0000  Median: 706.1840  Max: 11603830.0000
------------------------------------------------------
[     120,     140 )    8374  41.870%  41.870% ########
[     140,     160 )    1031   5.155%  47.025% #
[     160,     180 )      79   0.395%  47.420% 
[     180,     200 )     231   1.155%  48.575% 
[     200,     250 )      78   0.390%  48.965% 
[     250,     300 )       2   0.010%  48.975% 
[     300,     350 )       1   0.005%  48.980% 
[     350,     400 )       1   0.005%  48.985% 
[     600,     700 )     162   0.810%  49.795% 
[     700,     800 )     663   3.315%  53.110% #
[     800,     900 )    2539  12.695%  65.805% ###
[     900,    1000 )     296   1.480%  67.285% 
[    1000,    1200 )     506   2.530%  69.815% #
[    1200,    1400 )     560   2.800%  72.615% #
[    1400,    1600 )     208   1.040%  73.655% 
[    1600,    1800 )     190   0.950%  74.605% 
[    1800,    2000 )    1959   9.795%  84.400% ##
[    2000,    2500 )     972   4.860%  89.260% #
[    2500,    3000 )     102   0.510%  89.770% 
[    3000,    3500 )      47   0.235%  90.005% 
[    3500,    4000 )      41   0.205%  90.210% 
[    4000,    4500 )     241   1.205%  91.415% 
[    4500,    5000 )     946   4.730%  96.145% #
[    5000,    6000 )     421   2.105%  98.250% 
[    6000,    7000 )      18   0.090%  98.340% 
[    7000,    8000 )       9   0.045%  98.385% 
[    9000,   10000 )       1   0.005%  98.390% 
[   50000,   60000 )     143   0.715%  99.105% 
[   60000,   70000 )     133   0.665%  99.770% 
[   70000,   80000 )       3   0.015%  99.785% 
[   80000,   90000 )       3   0.015%  99.800% 
[   90000,  100000 )      10   0.050%  99.850% 
[  100000,  120000 )       1   0.005%  99.855% 
[  120000,  140000 )       1   0.005%  99.860% 
[  180000,  200000 )       1   0.005%  99.865% 
[  200000,  250000 )       1   0.005%  99.870% 
[  900000, 1000000 )       1   0.005%  99.875% 
[ 2000000, 2500000 )       1   0.005%  99.880% 
[ 2500000, 3000000 )       1   0.005%  99.885% 
[ 3500000, 4000000 )       1   0.005%  99.890% 
[ 4000000, 4500000 )       1   0.005%  99.895% 
[ 4500000, 5000000 )       1   0.005%  99.900% 
[ 5000000, 6000000 )       4   0.020%  99.920% 
[ 6000000, 7000000 )       6   0.030%  99.950% 
[ 7000000, 8000000 )       3   0.015%  99.965% 
[ 8000000, 9000000 )       3   0.015%  99.980% 
[ 10000000, 12000000 )       4   0.020% 100.000%