benchmark/leveldb/results/micro/mris_ran_wt_ssd.1.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:24:31 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :    7688.884 micros/op;    8.6 MB/s
Microseconds per op:
Count: 20000  Average: 7688.4637  StdDev: 177257.79
Min: 112.0000  Median: 702.9283  Max: 7449040.0000
------------------------------------------------------
[     100,     120 )      22   0.110%   0.110% 
[     120,     140 )    8424  42.120%  42.230% ########
[     140,     160 )     957   4.785%  47.015% #
[     160,     180 )     110   0.550%  47.565% 
[     180,     200 )     219   1.095%  48.660% 
[     200,     250 )      70   0.350%  49.010% 
[     250,     300 )       2   0.010%  49.020% 
[     350,     400 )       3   0.015%  49.035% 
[     400,     450 )       1   0.005%  49.040% 
[     600,     700 )     172   0.860%  49.900% 
[     700,     800 )     683   3.415%  53.315% #
[     800,     900 )    2493  12.465%  65.780% ##
[     900,    1000 )     316   1.580%  67.360% 
[    1000,    1200 )     518   2.590%  69.950% #
[    1200,    1400 )     531   2.655%  72.605% #
[    1400,    1600 )     220   1.100%  73.705% 
[    1600,    1800 )     175   0.875%  74.580% 
[    1800,    2000 )    1976   9.880%  84.460% ##
[    2000,    2500 )     976   4.880%  89.340% #
[    2500,    3000 )      93   0.465%  89.805% 
[    3000,    3500 )      49   0.245%  90.050% 
[    3500,    4000 )      40   0.200%  90.250% 
[    4000,    4500 )     209   1.045%  91.295% 
[    4500,    5000 )     917   4.585%  95.880% #
[    5000,    6000 )     456   2.280%  98.160% 
[    6000,    7000 )      32   0.160%  98.320% 
[    7000,    8000 )      13   0.065%  98.385% 
[    8000,    9000 )       1   0.005%  98.390% 
[   30000,   35000 )       1   0.005%  98.395% 
[   35000,   40000 )      87   0.435%  98.830% 
[   40000,   45000 )     194   0.970%  99.800% 
[   45000,   50000 )       6   0.030%  99.830% 
[   50000,   60000 )       2   0.010%  99.840% 
[   60000,   70000 )       2   0.010%  99.850% 
[   70000,   80000 )       2   0.010%  99.860% 
[   80000,   90000 )       1   0.005%  99.865% 
[  200000,  250000 )       1   0.005%  99.870% 
[  600000,  700000 )       1   0.005%  99.875% 
[ 1400000, 1600000 )       1   0.005%  99.880% 
[ 2000000, 2500000 )       1   0.005%  99.885% 
[ 2500000, 3000000 )       1   0.005%  99.890% 
[ 3000000, 3500000 )       1   0.005%  99.895% 
[ 3500000, 4000000 )       3   0.015%  99.910% 
[ 4000000, 4500000 )       3   0.015%  99.925% 
[ 4500000, 5000000 )       5   0.025%  99.950% 
[ 5000000, 6000000 )       4   0.020%  99.970% 
[ 6000000, 7000000 )       4   0.020%  99.990% 
[ 7000000, 8000000 )       2   0.010% 100.000%