benchmark/leveldb/results/micro/mris_ran_wt_ssd.2.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:27:07 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :    7630.238 micros/op;    8.7 MB/s
Microseconds per op:
Count: 20000  Average: 7629.8553  StdDev: 175514.29
Min: 116.0000  Median: 703.1339  Max: 7378041.0000
------------------------------------------------------
[     100,     120 )      27   0.135%   0.135% 
[     120,     140 )    8368  41.840%  41.975% ########
[     140,     160 )     979   4.895%  46.870% #
[     160,     180 )     106   0.530%  47.400% 
[     180,     200 )     229   1.145%  48.545% 
[     200,     250 )      72   0.360%  48.905% 
[     250,     300 )       3   0.015%  48.920% 
[     300,     350 )       1   0.005%  48.925% 
[     350,     400 )       4   0.020%  48.945% 
[     400,     450 )       2   0.010%  48.955% 
[     600,     700 )     187   0.935%  49.890% 
[     700,     800 )     702   3.510%  53.400% #
[     800,     900 )    2482  12.410%  65.810% ##
[     900,    1000 )     283   1.415%  67.225% 
[    1000,    1200 )     568   2.840%  70.065% #
[    1200,    1400 )     507   2.535%  72.600% #
[    1400,    1600 )     205   1.025%  73.625% 
[    1600,    1800 )     166   0.830%  74.455% 
[    1800,    2000 )    1750   8.750%  83.205% ##
[    2000,    2500 )    1162   5.810%  89.015% #
[    2500,    3000 )     137   0.685%  89.700% 
[    3000,    3500 )      44   0.220%  89.920% 
[    3500,    4000 )      25   0.125%  90.045% 
[    4000,    4500 )     242   1.210%  91.255% 
[    4500,    5000 )     930   4.650%  95.905% #
[    5000,    6000 )     457   2.285%  98.190% 
[    6000,    7000 )      31   0.155%  98.345% 
[    7000,    8000 )       7   0.035%  98.380% 
[    8000,    9000 )       1   0.005%  98.385% 
[    9000,   10000 )       1   0.005%  98.390% 
[   30000,   35000 )      10   0.050%  98.440% 
[   35000,   40000 )      98   0.490%  98.930% 
[   40000,   45000 )     170   0.850%  99.780% 
[   45000,   50000 )       9   0.045%  99.825% 
[   50000,   60000 )       7   0.035%  99.860% 
[   70000,   80000 )       1   0.005%  99.865% 
[  200000,  250000 )       1   0.005%  99.870% 
[  600000,  700000 )       1   0.005%  99.875% 
[ 1600000, 1800000 )       1   0.005%  99.880% 
[ 2000000, 2500000 )       1   0.005%  99.885% 
[ 2500000, 3000000 )       1   0.005%  99.890% 
[ 3000000, 3500000 )       1   0.005%  99.895% 
[ 3500000, 4000000 )       3   0.015%  99.910% 
[ 4000000, 4500000 )       3   0.015%  99.925% 
[ 4500000, 5000000 )       6   0.030%  99.955% 
[ 5000000, 6000000 )       3   0.015%  99.970% 
[ 6000000, 7000000 )       4   0.020%  99.990% 
[ 7000000, 8000000 )       2   0.010% 100.000%