benchmark/leveldb/results/micro/mris_ran_wt_ssd.3.log
LevelDB:    version 1.5
Date:       Sat Dec  1 15:29:41 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
./table/mris.h:637: [mris] Failed to open /mnt/largespace/mris_ran_wt_db
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    10000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
----- /mnt/largespace/mris_ran_wt_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	0
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0
mris_ran_wt  :    7623.932 micros/op;    8.7 MB/s
Microseconds per op:
Count: 20000  Average: 7623.4916  StdDev: 175377.09
Min: 117.0000  Median: 707.7035  Max: 7354076.0000
------------------------------------------------------
[     100,     120 )      26   0.130%   0.130% 
[     120,     140 )    8414  42.070%  42.200% ########
[     140,     160 )     926   4.630%  46.830% #
[     160,     180 )     105   0.525%  47.355% 
[     180,     200 )     206   1.030%  48.385% 
[     200,     250 )      75   0.375%  48.760% 
[     250,     300 )       2   0.010%  48.770% 
[     300,     350 )       1   0.005%  48.775% 
[     350,     400 )       9   0.045%  48.820% 
[     400,     450 )       2   0.010%  48.830% 
[     450,     500 )       1   0.005%  48.835% 
[     600,     700 )     180   0.900%  49.735% 
[     700,     800 )     688   3.440%  53.175% #
[     800,     900 )    2513  12.565%  65.740% ###
[     900,    1000 )     277   1.385%  67.125% 
[    1000,    1200 )     576   2.880%  70.005% #
[    1200,    1400 )     541   2.705%  72.710% #
[    1400,    1600 )     194   0.970%  73.680% 
[    1600,    1800 )     204   1.020%  74.700% 
[    1800,    2000 )    2015  10.075%  84.775% ##
[    2000,    2500 )     915   4.575%  89.350% #
[    2500,    3000 )     106   0.530%  89.880% 
[    3000,    3500 )      47   0.235%  90.115% 
[    3500,    4000 )      46   0.230%  90.345% 
[    4000,    4500 )     254   1.270%  91.615% 
[    4500,    5000 )     889   4.445%  96.060% #
[    5000,    6000 )     422   2.110%  98.170% 
[    6000,    7000 )      34   0.170%  98.340% 
[    7000,    8000 )       7   0.035%  98.375% 
[    8000,    9000 )       2   0.010%  98.385% 
[    9000,   10000 )       1   0.005%  98.390% 
[   30000,   35000 )       6   0.030%  98.420% 
[   35000,   40000 )      92   0.460%  98.880% 
[   40000,   45000 )     175   0.875%  99.755% 
[   45000,   50000 )      13   0.065%  99.820% 
[   50000,   60000 )       7   0.035%  99.855% 
[   60000,   70000 )       1   0.005%  99.860% 
[   70000,   80000 )       1   0.005%  99.865% 
[  200000,  250000 )       1   0.005%  99.870% 
[  600000,  700000 )       1   0.005%  99.875% 
[ 1400000, 1600000 )       1   0.005%  99.880% 
[ 2000000, 2500000 )       1   0.005%  99.885% 
[ 2500000, 3000000 )       1   0.005%  99.890% 
[ 3000000, 3500000 )       1   0.005%  99.895% 
[ 3500000, 4000000 )       2   0.010%  99.905% 
[ 4000000, 4500000 )       4   0.020%  99.925% 
[ 4500000, 5000000 )       6   0.030%  99.955% 
[ 5000000, 6000000 )       3   0.015%  99.970% 
[ 6000000, 7000000 )       4   0.020%  99.990% 
[ 7000000, 8000000 )       2   0.010% 100.000%